# will be installed using `code --install-extension`

## nix interpreter
bbenoist.nix

## python
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance

## ruff
charliermarsh.ruff

## jupyter
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
xelad0m.jupyter-toc

## copilot
github.copilot
github.copilot-chat

## git utils
donjayamanne.githistory
eamodio.gitlens

## collaboration
ms-vsliveshare.vsliveshare

## docker
ms-azuretools.vscode-docker

## markdown
davidanson.vscode-markdownlint
yzhang.markdown-all-in-one
darkriszty.markdown-table-prettify

## restructuredtext
lextudio.restructuredtext
swyddfa.esbonio
trond-snekvik.simple-rst

## remote
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.remote-explorer
ms-vscode.remote-server

## spell checker
streetsidesoftware.code-spell-checker

## file icons
jamesmaj.easy-icons

## makefile
ms-vscode.makefile-tools

## toml
tamasfe.even-better-toml

## yaml
redhat.vscode-yaml

## miscellaneous
alexcvzz.vscode-sqlite
github.vscode-github-actions
ms-azuretools.vscode-containers