# will be installed using `code --install-extension`

## nix interpreter
bbenoist.nix

## python
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance

## ruff
charliermarsh.ruff

## jupyter
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

## copilot
github.copilot
github.copilot-chat

## git utils
donjayamanne.githistory
eamodio.gitlens

## collaboration
ms-vsliveshare.vsliveshare

## docker
ms-azuretools.vscode-docker

## markdown
davidanson.vscode-markdownlint

## remote
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.remote-explorer
ms-vscode.remote-server